; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_4 ?v6 ?v12)
             (pred_2 ?v2 ?v13)
             (pred_11 ?v6 ?v13)
             (pred_8 ?v5 ?v6 )
	     (pred_3 ?v6)
             (pred_5 ?v9)
             (pred_12 ?v2)
             (pred_7 ?v13)
             (pred_6 ?v6)
             (pred_1 ?v2)
             (pred_10 ?v6)
             (pred_9 ))



(:action op_3
:parameters (?v11 ?v7 ?v4 ?v10)
:precondition (and (pred_5 ?v11) (pred_5 ?v7) (pred_12 ?v4) (pred_7 ?v10)
          (pred_4 ?v11 ?v7) (pred_2 ?v4 ?v10)
                   (pred_11 ?v7 ?v10) (pred_3 ?v11) 
                   (pred_6 ?v7) (pred_1 ?v4))
:effect (and  (pred_10 ?v7) (not (pred_6 ?v7))))


(:action op_1
:parameters (?v11 ?v8)
:precondition (and (pred_5 ?v11) (pred_5 ?v8)
               (pred_3 ?v11) (pred_4 ?v11 ?v8) (pred_10 ?v8))
:effect (and (pred_3 ?v8) (not (pred_3 ?v11))))

(:action op_4
:parameters (?v11 ?v4)
:precondition (and (pred_5 ?v11) (pred_12 ?v4) 
                  (pred_3 ?v11) (pred_8 ?v4 ?v11) (pred_9 ))
:effect (and (pred_1 ?v4)
   (not (pred_8 ?v4 ?v11)) (not (pred_9 ))))


(:action op_5
:parameters (?v11 ?v3 ?v1)
:precondition (and (pred_5 ?v11) (pred_12 ?v3) (pred_12 ?v1)
                  (pred_3 ?v11) (pred_1 ?v1) (pred_8 ?v3 ?v11))
:effect (and (pred_1 ?v3) (pred_8 ?v1 ?v11)
        (not (pred_1 ?v1)) (not (pred_8 ?v3 ?v11))))

(:action op_2
:parameters (?v11 ?v4)
:precondition (and (pred_5 ?v11) (pred_12 ?v4) 
                  (pred_3 ?v11) (pred_1 ?v4))
:effect (and (pred_9 ) (pred_8 ?v4 ?v11) (not (pred_1 ?v4)))))

; problem
(define (problem grid-5-5-3-3-3)
    (:domain grid)
    (:objects
    obj_05 obj_08 obj_16 obj_14 obj_07 obj_18 obj_01 obj_19 obj_20 obj_30 obj_06 obj_21 obj_25 obj_27 obj_02 obj_04 obj_22 obj_13 obj_24 obj_29 obj_09 obj_17 obj_15 obj_03 obj_10
    obj_12 obj_31 obj_28
    obj_23 obj_11 obj_26
    )

    (:init
       (pred_9)

       (pred_5 obj_05)
       (pred_5 obj_08)
       (pred_5 obj_16)
       (pred_5 obj_14)
       (pred_5 obj_07)
       (pred_5 obj_18)
       (pred_5 obj_01)
       (pred_5 obj_19)
       (pred_5 obj_20)
       (pred_5 obj_30)
       (pred_5 obj_06)
       (pred_5 obj_21)
       (pred_5 obj_25)
       (pred_5 obj_27)
       (pred_5 obj_02)
       (pred_5 obj_04)
       (pred_5 obj_22)
       (pred_5 obj_13)
       (pred_5 obj_24)
       (pred_5 obj_29)
       (pred_5 obj_09)
       (pred_5 obj_17)
       (pred_5 obj_15)
       (pred_5 obj_03)
       (pred_5 obj_10)
       (pred_7 obj_12)
       (pred_7 obj_31)
       (pred_7 obj_28)
       (pred_12 obj_23)
       (pred_12 obj_11)
       (pred_12 obj_26)

       (pred_4 obj_05 obj_18)
       (pred_4 obj_05 obj_08)
       (pred_4 obj_08 obj_01)
       (pred_4 obj_08 obj_16)
       (pred_4 obj_08 obj_05)
       (pred_4 obj_16 obj_19)
       (pred_4 obj_16 obj_14)
       (pred_4 obj_16 obj_08)
       (pred_4 obj_14 obj_20)
       (pred_4 obj_14 obj_07)
       (pred_4 obj_14 obj_16)
       (pred_4 obj_07 obj_30)
       (pred_4 obj_07 obj_14)
       (pred_4 obj_18 obj_06)
       (pred_4 obj_18 obj_01)
       (pred_4 obj_18 obj_05)
       (pred_4 obj_01 obj_21)
       (pred_4 obj_01 obj_19)
       (pred_4 obj_01 obj_08)
       (pred_4 obj_01 obj_18)
       (pred_4 obj_19 obj_25)
       (pred_4 obj_19 obj_20)
       (pred_4 obj_19 obj_16)
       (pred_4 obj_19 obj_01)
       (pred_4 obj_20 obj_27)
       (pred_4 obj_20 obj_30)
       (pred_4 obj_20 obj_14)
       (pred_4 obj_20 obj_19)
       (pred_4 obj_30 obj_02)
       (pred_4 obj_30 obj_07)
       (pred_4 obj_30 obj_20)
       (pred_4 obj_06 obj_04)
       (pred_4 obj_06 obj_21)
       (pred_4 obj_06 obj_18)
       (pred_4 obj_21 obj_22)
       (pred_4 obj_21 obj_25)
       (pred_4 obj_21 obj_01)
       (pred_4 obj_21 obj_06)
       (pred_4 obj_25 obj_13)
       (pred_4 obj_25 obj_27)
       (pred_4 obj_25 obj_19)
       (pred_4 obj_25 obj_21)
       (pred_4 obj_27 obj_24)
       (pred_4 obj_27 obj_02)
       (pred_4 obj_27 obj_20)
       (pred_4 obj_27 obj_25)
       (pred_4 obj_02 obj_29)
       (pred_4 obj_02 obj_30)
       (pred_4 obj_02 obj_27)
       (pred_4 obj_04 obj_09)
       (pred_4 obj_04 obj_22)
       (pred_4 obj_04 obj_06)
       (pred_4 obj_22 obj_17)
       (pred_4 obj_22 obj_13)
       (pred_4 obj_22 obj_21)
       (pred_4 obj_22 obj_04)
       (pred_4 obj_13 obj_15)
       (pred_4 obj_13 obj_24)
       (pred_4 obj_13 obj_25)
       (pred_4 obj_13 obj_22)
       (pred_4 obj_24 obj_03)
       (pred_4 obj_24 obj_29)
       (pred_4 obj_24 obj_27)
       (pred_4 obj_24 obj_13)
       (pred_4 obj_29 obj_10)
       (pred_4 obj_29 obj_02)
       (pred_4 obj_29 obj_24)
       (pred_4 obj_09 obj_17)
       (pred_4 obj_09 obj_04)
       (pred_4 obj_17 obj_15)
       (pred_4 obj_17 obj_22)
       (pred_4 obj_17 obj_09)
       (pred_4 obj_15 obj_03)
       (pred_4 obj_15 obj_13)
       (pred_4 obj_15 obj_17)
       (pred_4 obj_03 obj_10)
       (pred_4 obj_03 obj_24)
       (pred_4 obj_03 obj_15)
       (pred_4 obj_10 obj_29)
       (pred_4 obj_10 obj_03)
       (pred_6 obj_02)
       (pred_6 obj_25)
       (pred_6 obj_17)
       (pred_11  obj_02 obj_12)
       (pred_11  obj_25 obj_31)
       (pred_11  obj_17 obj_28)
       (pred_10 obj_05)
       (pred_10 obj_08)
       (pred_10 obj_16)
       (pred_10 obj_14)
       (pred_10 obj_07)
       (pred_10 obj_18)
       (pred_10 obj_01)
       (pred_10 obj_19)
       (pred_10 obj_20)
       (pred_10 obj_30)
       (pred_10 obj_06)
       (pred_10 obj_21)
       (pred_10 obj_27)
       (pred_10 obj_04)
       (pred_10 obj_22)
       (pred_10 obj_13)
       (pred_10 obj_24)
       (pred_10 obj_29)
       (pred_10 obj_09)
       (pred_10 obj_15)
       (pred_10 obj_03)
       (pred_10 obj_10)

       (pred_2  obj_23 obj_12)
       (pred_2  obj_11 obj_31)
       (pred_2  obj_26 obj_28)
       (pred_8 obj_23 obj_07)
       (pred_8 obj_11 obj_29)
       (pred_8 obj_26 obj_21)
       (pred_3 obj_16)
    )

    (:goal (and
       (pred_8 obj_23 obj_19)
    ))
(:constraints
  (always (not (pred_3 obj_14)))
)
)

; plan
1. (op_1 obj_16 obj_19)
   deleted: (pred_3 obj_16)
   added: (pred_3 obj_19)
   goals met: 0 of 1
2. (op_1 obj_19 obj_20)
   deleted: (pred_3 obj_19)
   added: (pred_3 obj_20)
   goals met: 0 of 1
3. (op_1 obj_20 obj_30)
   deleted: (pred_3 obj_20)
   added: (pred_3 obj_30)
   goals met: 0 of 1
4. (op_1 obj_30 obj_07)
   deleted: (pred_3 obj_30)
   added: (pred_3 obj_07)
   goals met: 0 of 1
5. (op_4 obj_07 obj_23)
   deleted: (pred_8 obj_23 obj_07) (pred_9)
   added: (pred_1 obj_23)
   goals met: 0 of 1
6. (op_1 obj_07 obj_30)
   deleted: (pred_3 obj_07)
   added: (pred_3 obj_30)
   goals met: 0 of 1
7. (op_1 obj_30 obj_20)
   deleted: (pred_3 obj_30)
   added: (pred_3 obj_20)
   goals met: 0 of 1
8. (op_1 obj_20 obj_19)
   deleted: (pred_3 obj_20)
   added: (pred_3 obj_19)
   goals met: 0 of 1
9. (op_2 obj_19 obj_23)
   deleted: (pred_1 obj_23)
   added: (pred_9) (pred_8 obj_23 obj_19)
   goals met: 1 of 1
